benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-cal-69026.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms  727.03us   4.47ms   68.22%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.81ms
 90.000%    2.43ms
 99.000%    3.24ms
 99.900%    3.70ms
 99.990%    4.02ms
 99.999%    4.24ms
100.000%    4.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.027     0.000000            1         1.00
       0.527     0.100000        68023         1.11
       0.700     0.200000       136225         1.25
       0.854     0.300000       204221         1.43
       1.021     0.400000       271877         1.67
       1.212     0.500000       339750         2.00
       1.315     0.550000       373951         2.22
       1.424     0.600000       407792         2.50
       1.541     0.650000       441620         2.86
       1.668     0.700000       475729         3.33
       1.811     0.750000       509709         4.00
       1.885     0.775000       526555         4.44
       1.963     0.800000       543655         5.00
       2.047     0.825000       560615         5.71
       2.149     0.850000       577577         6.67
       2.281     0.875000       594606         8.00
       2.357     0.887500       603098         8.89
       2.435     0.900000       611544        10.00
       2.517     0.912500       620068        11.43
       2.601     0.925000       628571        13.33
       2.687     0.937500       636911        16.00
       2.733     0.943750       641181        17.78
       2.781     0.950000       645476        20.00
       2.829     0.956250       649682        22.86
       2.883     0.962500       653946        26.67
       2.943     0.968750       658148        32.00
       2.975     0.971875       660266        35.56
       3.011     0.975000       662456        40.00
       3.049     0.978125       664522        45.71
       3.091     0.981250       666681        53.33
       3.137     0.984375       668806        64.00
       3.163     0.985938       669831        71.11
       3.193     0.987500       670935        80.00
       3.225     0.989062       671967        91.43
       3.259     0.990625       673034       106.67
       3.299     0.992188       674080       128.00
       3.323     0.992969       674593       142.22
       3.351     0.993750       675144       160.00
       3.379     0.994531       675641       182.86
       3.413     0.995313       676172       213.33
       3.455     0.996094       676719       256.00
       3.477     0.996484       676986       284.44
       3.503     0.996875       677245       320.00
       3.531     0.997266       677510       365.71
       3.561     0.997656       677768       426.67
       3.597     0.998047       678036       512.00
       3.613     0.998242       678166       568.89
       3.631     0.998437       678302       640.00
       3.651     0.998633       678429       731.43
       3.679     0.998828       678559       853.33
       3.705     0.999023       678691      1024.00
       3.721     0.999121       678759      1137.78
       3.741     0.999219       678825      1280.00
       3.763     0.999316       678893      1462.86
       3.785     0.999414       678959      1706.67
       3.813     0.999512       679024      2048.00
       3.831     0.999561       679056      2275.56
       3.851     0.999609       679088      2560.00
       3.863     0.999658       679122      2925.71
       3.885     0.999707       679158      3413.33
       3.907     0.999756       679192      4096.00
       3.923     0.999780       679204      4551.11
       3.941     0.999805       679221      5120.00
       3.953     0.999829       679237      5851.43
       3.971     0.999854       679256      6826.67
       3.999     0.999878       679273      8192.00
       4.015     0.999890       679282      9102.22
       4.023     0.999902       679287     10240.00
       4.051     0.999915       679295     11702.86
       4.069     0.999927       679304     13653.33
       4.085     0.999939       679312     16384.00
       4.091     0.999945       679317     18204.44
       4.095     0.999951       679320     20480.00
       4.111     0.999957       679324     23405.71
       4.127     0.999963       679331     27306.67
       4.143     0.999969       679333     32768.00
       4.155     0.999973       679335     36408.89
       4.167     0.999976       679337     40960.00
       4.191     0.999979       679339     46811.43
       4.211     0.999982       679341     54613.33
       4.219     0.999985       679343     65536.00
       4.231     0.999986       679345     72817.78
       4.231     0.999988       679345     81920.00
       4.239     0.999989       679346     93622.86
       4.267     0.999991       679348    109226.67
       4.267     0.999992       679348    131072.00
       4.279     0.999993       679350    145635.56
       4.279     0.999994       679350    163840.00
       4.279     0.999995       679350    187245.71
       4.279     0.999995       679350    218453.33
       4.351     0.999996       679351    262144.00
       4.351     0.999997       679351    291271.11
       4.351     0.999997       679351    327680.00
       4.403     0.999997       679352    374491.43
       4.403     0.999998       679352    436906.67
       4.403     0.999998       679352    524288.00
       4.403     0.999998       679352    582542.22
       4.403     0.999998       679352    655360.00
       4.471     0.999999       679353    748982.86
       4.471     1.000000       679353          inf
#[Mean    =        1.351, StdDeviation   =        0.727]
#[Max     =        4.468, Total count    =       679353]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  679394 requests in 10.00s, 75.81MB read
Requests/sec:  67927.63
Transfer/sec:      7.58MB