benchmark/results/v0.7/baseline-pre-v0.7/RAW/flare-plaintext-throughput-cal-70680.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms  728.61us   4.97ms   69.78%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.20ms
 75.000%    1.79ms
 90.000%    2.44ms
 99.000%    3.29ms
 99.900%    4.10ms
 99.990%    4.60ms
 99.999%    4.81ms
100.000%    4.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.034     0.000000            2         1.00
       0.548     0.100000        69903         1.11
       0.721     0.200000       139247         1.25
       0.867     0.300000       209009         1.43
       1.023     0.400000       278484         1.67
       1.203     0.500000       347974         2.00
       1.302     0.550000       382831         2.22
       1.403     0.600000       417429         2.50
       1.515     0.650000       452415         2.86
       1.642     0.700000       487126         3.33
       1.788     0.750000       521758         4.00
       1.869     0.775000       539186         4.44
       1.953     0.800000       556610         5.00
       2.040     0.825000       574075         5.71
       2.141     0.850000       591458         6.67
       2.275     0.875000       608711         8.00
       2.355     0.887500       617403         8.89
       2.439     0.900000       626234        10.00
       2.525     0.912500       634830        11.43
       2.613     0.925000       643525        13.33
       2.709     0.937500       652329        16.00
       2.757     0.943750       656667        17.78
       2.807     0.950000       660920        20.00
       2.859     0.956250       665282        22.86
       2.915     0.962500       669648        26.67
       2.973     0.968750       673909        32.00
       3.007     0.971875       676115        35.56
       3.043     0.975000       678265        40.00
       3.083     0.978125       680436        45.71
       3.127     0.981250       682667        53.33
       3.173     0.984375       684794        64.00
       3.201     0.985938       685920        71.11
       3.229     0.987500       686957        80.00
       3.265     0.989062       688070        91.43
       3.303     0.990625       689125       106.67
       3.357     0.992188       690220       128.00
       3.387     0.992969       690756       142.22
       3.427     0.993750       691295       160.00
       3.477     0.994531       691847       182.86
       3.539     0.995313       692385       213.33
       3.611     0.996094       692925       256.00
       3.655     0.996484       693187       284.44
       3.701     0.996875       693458       320.00
       3.757     0.997266       693732       365.71
       3.817     0.997656       694005       426.67
       3.889     0.998047       694286       512.00
       3.921     0.998242       694416       568.89
       3.961     0.998437       694545       640.00
       4.007     0.998633       694682       731.43
       4.051     0.998828       694816       853.33
       4.111     0.999023       694953      1024.00
       4.147     0.999121       695026      1137.78
       4.175     0.999219       695088      1280.00
       4.207     0.999316       695158      1462.86
       4.247     0.999414       695227      1706.67
       4.291     0.999512       695297      2048.00
       4.319     0.999561       695330      2275.56
       4.343     0.999609       695362      2560.00
       4.367     0.999658       695395      2925.71
       4.407     0.999707       695432      3413.33
       4.447     0.999756       695462      4096.00
       4.471     0.999780       695480      4551.11
       4.503     0.999805       695498      5120.00
       4.523     0.999829       695514      5851.43
       4.555     0.999854       695532      6826.67
       4.587     0.999878       695549      8192.00
       4.591     0.999890       695556      9102.22
       4.603     0.999902       695564     10240.00
       4.619     0.999915       695576     11702.86
       4.631     0.999927       695581     13653.33
       4.651     0.999939       695589     16384.00
       4.659     0.999945       695593     18204.44
       4.667     0.999951       695599     20480.00
       4.687     0.999957       695602     23405.71
       4.707     0.999963       695607     27306.67
       4.731     0.999969       695610     32768.00
       4.735     0.999973       695612     36408.89
       4.743     0.999976       695615     40960.00
       4.755     0.999979       695617     46811.43
       4.763     0.999982       695619     54613.33
       4.787     0.999985       695622     65536.00
       4.787     0.999986       695622     72817.78
       4.791     0.999988       695623     81920.00
       4.811     0.999989       695624     93622.86
       4.823     0.999991       695625    109226.67
       4.871     0.999992       695626    131072.00
       4.903     0.999993       695628    145635.56
       4.903     0.999994       695628    163840.00
       4.903     0.999995       695628    187245.71
       4.903     0.999995       695628    218453.33
       4.907     0.999996       695629    262144.00
       4.907     0.999997       695629    291271.11
       4.907     0.999997       695629    327680.00
       4.963     0.999997       695630    374491.43
       4.963     0.999998       695630    436906.67
       4.963     0.999998       695630    524288.00
       4.963     0.999998       695630    582542.22
       4.963     0.999998       695630    655360.00
       4.971     0.999999       695631    748982.86
       4.971     1.000000       695631          inf
#[Mean    =        1.354, StdDeviation   =        0.729]
#[Max     =        4.968, Total count    =       695631]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  695676 requests in 10.00s, 77.62MB read
Requests/sec:  69559.89
Transfer/sec:      7.76MB